remote-home/testdata/goal_runs/20260709_234926_h6_1c_full_throughput_all/bench.log
===== throughput: 4-8K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f9a2a8a4a60>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_234926_h6_1c_full_throughput_all/results/4-8K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-d5cc86c6-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 23:49:53 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:30<00:00, 15.24s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [16:24<00:00, 19.68s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  984.15    
Total input tokens:                      315769    
Total generated tokens:                  12579     
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         12.78     
Peak output token throughput (tok/s):    16.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          333.64    
---------------Time to First Token----------------
Mean TTFT (ms):                          2578.47   
Median TTFT (ms):                        2692.55   
P50 TTFT (ms):                           2692.55   
P95 TTFT (ms):                           3267.65   
P99 TTFT (ms):                           3459.79   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.16     
Median TPOT (ms):                        68.12     
P50 TPOT (ms):                           68.12     
P95 TPOT (ms):                           68.37     
P99 TPOT (ms):                           68.44     
---------------Inter-token Latency----------------
Mean ITL (ms):                           67.93     
Median ITL (ms):                         68.20     
P50 ITL (ms):                            68.20     
P95 ITL (ms):                            68.76     
P99 ITL (ms):                            69.39     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          19667.39  
Median E2EL (ms):                        8663.96   
P50 E2EL (ms):                           8663.96   
P95 E2EL (ms):                           72488.72  
P99 E2EL (ms):                           73007.67  
==================================================
===== throughput: 8-16K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f9a60a48a60>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./8-16K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_234926_h6_1c_full_throughput_all/results/8-16K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-42146dad-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-10 00:07:17 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:28<00:00, 14.26s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [21:33<00:00, 25.88s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  1293.89   
Total input tokens:                      664763    
Total generated tokens:                  13637     
Request throughput (req/s):              0.04      
Output token throughput (tok/s):         10.54     
Peak output token throughput (tok/s):    16.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          524.31    
---------------Time to First Token----------------
Mean TTFT (ms):                          7130.06   
Median TTFT (ms):                        7594.07   
P50 TTFT (ms):                           7594.07   
P95 TTFT (ms):                           9111.11   
P99 TTFT (ms):                           10020.25  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.89     
Median TPOT (ms):                        68.89     
P50 TPOT (ms):                           68.89     
P95 TPOT (ms):                           69.37     
P99 TPOT (ms):                           69.39     
---------------Inter-token Latency----------------
Mean ITL (ms):                           68.68     
Median ITL (ms):                         68.96     
P50 ITL (ms):                            68.96     
P95 ITL (ms):                            69.59     
P99 ITL (ms):                            70.20     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          25862.29  
Median E2EL (ms):                        13506.03  
P50 E2EL (ms):                           13506.03  
P95 E2EL (ms):                           75555.20  
P99 E2EL (ms):                           77265.22  
==================================================
===== throughput: 16-32K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f263651ca60>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./16-32K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_234926_h6_1c_full_throughput_all/results/16-32K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-b543c679-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-10 00:29:51 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:30<00:00, 15.01s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [24:56<00:00, 29.92s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  1496.21   
Total input tokens:                      1078097   
Total generated tokens:                  11055     
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         7.39      
Peak output token throughput (tok/s):    16.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          727.94    
---------------Time to First Token----------------
Mean TTFT (ms):                          14438.86  
Median TTFT (ms):                        14529.85  
P50 TTFT (ms):                           14529.85  
P95 TTFT (ms):                           15240.45  
P99 TTFT (ms):                           15255.00  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          70.04     
Median TPOT (ms):                        70.18     
P50 TPOT (ms):                           70.18     
P95 TPOT (ms):                           70.37     
P99 TPOT (ms):                           70.40     
---------------Inter-token Latency----------------
Mean ITL (ms):                           69.97     
Median ITL (ms):                         70.31     
P50 ITL (ms):                            70.31     
P95 ITL (ms):                            70.90     
P99 ITL (ms):                            71.52     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          29908.59  
Median E2EL (ms):                        26189.67  
P50 E2EL (ms):                           26189.67  
P95 E2EL (ms):                           87044.30  
P99 E2EL (ms):                           87269.53  
==================================================

===== result files =====
/public/home/tangyu408/testdata/goal_runs/20260709_234926_h6_1c_full_throughput_all/results/8-16K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260709_234926_h6_1c_full_throughput_all/results/16-32K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260709_234926_h6_1c_full_throughput_all/results/4-8K_throughput/result.json